## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_route53_record.api-lambda-staging-notification-sandbox-A[0]`       |
|        | `aws_route53_record.api-weighted-0-staging-notification-sandbox-A[0]`   |
|        | `aws_route53_record.api-weighted-100-staging-notification-sandbox-A[0]` |
|        | `aws_route53_record.assets-staging-notification-sandbox-CNAME[0]`       |
|        | `aws_route53_record.staging-notification-sandbox-WC[0]`                 |
|        | `aws_route53_record.staging-notification-sandbox[0]`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.api-lambda-staging-notification-sandbox-A[0] will be created
  + resource "aws_route53_record" "api-lambda-staging-notification-sandbox-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-lambda.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "d-087bebwcdc.execute-api.ca-central-1.amazonaws.com"
          + zone_id                = "Z19DQILCV0OWEC"
        }
    }

  # aws_route53_record.api-weighted-0-staging-notification-sandbox-A[0] will be created
  + resource "aws_route53_record" "api-weighted-0-staging-notification-sandbox-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.staging.notification.cdssandbox.xyz"
      + set_identifier  = "loadbalancer"
      + type            = "A"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }

      + weighted_routing_policy {
          + weight = 0
        }
    }

  # aws_route53_record.api-weighted-100-staging-notification-sandbox-A[0] will be created
  + resource "aws_route53_record" "api-weighted-100-staging-notification-sandbox-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.staging.notification.cdssandbox.xyz"
      + set_identifier  = "lambda"
      + type            = "A"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "d-cmqtfgeja3.execute-api.ca-central-1.amazonaws.com"
          + zone_id                = "Z19DQILCV0OWEC"
        }

      + weighted_routing_policy {
          + weight = 100
        }
    }

  # aws_route53_record.assets-staging-notification-sandbox-CNAME[0] will be created
  + resource "aws_route53_record" "assets-staging-notification-sandbox-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "assets.staging.notification.cdssandbox.xyz"
      + records         = [
          + "d3ukkp8cndubgn.cloudfront.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.staging-notification-sandbox[0] will be created
  + resource "aws_route53_record" "staging-notification-sandbox" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "dualstack.notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.staging-notification-sandbox-WC[0] will be created
  + resource "aws_route53_record" "staging-notification-sandbox-WC" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "dualstack.notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
